zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/k2x/pinctrl/MK28FN2M0VMI15-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MK28FN2M0VMI15/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MK28FN2M0VMI15_
#define _ZEPHYR_DTS_BINDING_MK28FN2M0VMI15_

#define ADC0_SE10_PTA7 KINETIS_MUX('A',7,0)
#define ADC0_SE11_PTA8 KINETIS_MUX('A',8,0)
#define ADC0_SE12_PTB2 KINETIS_MUX('B',2,0)
#define ADC0_SE13_PTB3 KINETIS_MUX('B',3,0)
#define ADC0_SE14_PTC0 KINETIS_MUX('C',0,0)
#define ADC0_SE15_PTC1 KINETIS_MUX('C',1,0)
#define ADC0_SE4a_PTE16 KINETIS_MUX('E',16,0)
#define ADC0_SE4b_PTC2 KINETIS_MUX('C',2,0)
#define ADC0_SE5a_PTE17 KINETIS_MUX('E',17,0)
#define ADC0_SE5b_PTD1 KINETIS_MUX('D',1,0)
#define ADC0_SE6a_PTE18 KINETIS_MUX('E',18,0)
#define ADC0_SE6b_PTD5 KINETIS_MUX('D',5,0)
#define ADC0_SE7a_PTE19 KINETIS_MUX('E',19,0)
#define ADC0_SE7b_PTD6 KINETIS_MUX('D',6,0)
#define ADC0_SE8_PTB0 KINETIS_MUX('B',0,0)
#define ADC0_SE9_PTB1 KINETIS_MUX('B',1,0)
#define CLKOUT_PTA6 KINETIS_MUX('A',6,5)
#define CLKOUT_PTC3 KINETIS_MUX('C',3,5)
#define CMP0_IN0_PTC6 KINETIS_MUX('C',6,0)
#define CMP0_IN1_PTC7 KINETIS_MUX('C',7,0)
#define CMP0_IN2_PTC8 KINETIS_MUX('C',8,0)
#define CMP0_IN3_PTC9 KINETIS_MUX('C',9,0)
#define CMP0_OUT_PTB20 KINETIS_MUX('B',20,6)
#define CMP0_OUT_PTC5 KINETIS_MUX('C',5,6)
#define CMP1_IN0_PTC2 KINETIS_MUX('C',2,0)
#define CMP1_IN1_PTC3 KINETIS_MUX('C',3,0)
#define CMP1_OUT_PTB21 KINETIS_MUX('B',21,6)
#define CMP1_OUT_PTC4 KINETIS_MUX('C',4,6)
#define CMT_IRO_PTD7 KINETIS_MUX('D',7,2)
#define EWM_IN_PTA21 KINETIS_MUX('A',21,6)
#define EWM_IN_PTB16 KINETIS_MUX('B',16,6)
#define EWM_IN_PTD4 KINETIS_MUX('D',4,6)
#define EWM_OUT_b_PTA20 KINETIS_MUX('A',20,6)
#define EWM_OUT_b_PTB17 KINETIS_MUX('B',17,6)
#define EWM_OUT_b_PTD5 KINETIS_MUX('D',5,6)
#define EXTAL0_PTA18 KINETIS_MUX('A',18,0)
#define FTM0_CH0_PTA3 KINETIS_MUX('A',3,3)
#define FTM0_CH0_PTC1 KINETIS_MUX('C',1,4)
#define FTM0_CH1_PTA4 KINETIS_MUX('A',4,3)
#define FTM0_CH1_PTC2 KINETIS_MUX('C',2,4)
#define FTM0_CH2_PTA5 KINETIS_MUX('A',5,3)
#define FTM0_CH2_PTC3 KINETIS_MUX('C',3,4)
#define FTM0_CH2_PTC5 KINETIS_MUX('C',5,7)
#define FTM0_CH3_PTA6 KINETIS_MUX('A',6,3)
#define FTM0_CH3_PTC4 KINETIS_MUX('C',4,4)
#define FTM0_CH4_PTA7 KINETIS_MUX('A',7,3)
#define FTM0_CH4_PTD4 KINETIS_MUX('D',4,4)
#define FTM0_CH5_PTA0 KINETIS_MUX('A',0,3)
#define FTM0_CH5_PTD5 KINETIS_MUX('D',5,4)
#define FTM0_CH6_PTA1 KINETIS_MUX('A',1,3)
#define FTM0_CH6_PTD6 KINETIS_MUX('D',6,4)
#define FTM0_CH7_PTA2 KINETIS_MUX('A',2,3)
#define FTM0_CH7_PTD7 KINETIS_MUX('D',7,4)
#define FTM0_FLT0_PTB3 KINETIS_MUX('B',3,6)
#define FTM0_FLT0_PTD6 KINETIS_MUX('D',6,6)
#define FTM0_FLT1_PTB10 KINETIS_MUX('B',10,6)
#define FTM0_FLT1_PTD7 KINETIS_MUX('D',7,6)
#define FTM0_FLT2_PTA18 KINETIS_MUX('A',18,3)
#define FTM0_FLT2_PTB11 KINETIS_MUX('B',11,6)
#define FTM0_FLT3_PTB2 KINETIS_MUX('B',2,6)
#define FTM0_FLT3_PTE16 KINETIS_MUX('E',16,6)
#define FTM1_CH0_PTA12 KINETIS_MUX('A',12,3)
#define FTM1_CH0_PTA8 KINETIS_MUX('A',8,3)
#define FTM1_CH0_PTB0 KINETIS_MUX('B',0,3)
#define FTM1_CH1_PTA13 KINETIS_MUX('A',13,3)
#define FTM1_CH1_PTA9 KINETIS_MUX('A',9,3)
#define FTM1_CH1_PTB1 KINETIS_MUX('B',1,3)
#define FTM1_FLT0_PTA19 KINETIS_MUX('A',19,3)
#define FTM1_FLT0_PTB4 KINETIS_MUX('B',4,6)
#define FTM1_QD_PHA_PTA12 KINETIS_MUX('A',12,7)
#define FTM1_QD_PHA_PTA8 KINETIS_MUX('A',8,6)
#define FTM1_QD_PHA_PTB0 KINETIS_MUX('B',0,6)
#define FTM1_QD_PHB_PTA13 KINETIS_MUX('A',13,7)
#define FTM1_QD_PHB_PTA9 KINETIS_MUX('A',9,6)
#define FTM1_QD_PHB_PTB1 KINETIS_MUX('B',1,6)
#define FTM2_CH0_PTA10 KINETIS_MUX('A',10,3)
#define FTM2_CH0_PTB18 KINETIS_MUX('B',18,3)
#define FTM2_CH1_PTA11 KINETIS_MUX('A',11,3)
#define FTM2_CH1_PTB19 KINETIS_MUX('B',19,3)
#define FTM2_FLT0_PTB5 KINETIS_MUX('B',5,6)
#define FTM2_FLT0_PTC9 KINETIS_MUX('C',9,6)
#define FTM2_QD_PHA_PTA10 KINETIS_MUX('A',10,6)
#define FTM2_QD_PHA_PTB18 KINETIS_MUX('B',18,6)
#define FTM2_QD_PHB_PTA11 KINETIS_MUX('A',11,6)
#define FTM2_QD_PHB_PTB19 KINETIS_MUX('B',19,6)
#define FTM3_CH0_PTD0 KINETIS_MUX('D',0,4)
#define FTM3_CH0_PTE5 KINETIS_MUX('E',5,6)
#define FTM3_CH1_PTD1 KINETIS_MUX('D',1,4)
#define FTM3_CH1_PTE6 KINETIS_MUX('E',6,6)
#define FTM3_CH2_PTD2 KINETIS_MUX('D',2,4)
#define FTM3_CH2_PTE7 KINETIS_MUX('E',7,6)
#define FTM3_CH3_PTD3 KINETIS_MUX('D',3,4)
#define FTM3_CH3_PTE8 KINETIS_MUX('E',8,6)
#define FTM3_CH4_PTC8 KINETIS_MUX('C',8,3)
#define FTM3_CH4_PTE9 KINETIS_MUX('E',9,6)
#define FTM3_CH5_PTC9 KINETIS_MUX('C',9,3)
#define FTM3_CH5_PTE10 KINETIS_MUX('E',10,6)
#define FTM3_CH6_PTC10 KINETIS_MUX('C',10,3)
#define FTM3_CH6_PTE11 KINETIS_MUX('E',11,6)
#define FTM3_CH7_PTC11 KINETIS_MUX('C',11,3)
#define FTM3_CH7_PTE12 KINETIS_MUX('E',12,6)
#define FTM3_FLT0_PTC12 KINETIS_MUX('C',12,6)
#define FTM3_FLT0_PTD12 KINETIS_MUX('D',12,3)
#define FTM_CLKIN0_PTA18 KINETIS_MUX('A',18,4)
#define FTM_CLKIN0_PTB16 KINETIS_MUX('B',16,4)
#define FTM_CLKIN0_PTC12 KINETIS_MUX('C',12,4)
#define FTM_CLKIN0_PTE16 KINETIS_MUX('E',16,4)
#define FTM_CLKIN1_PTA19 KINETIS_MUX('A',19,4)
#define FTM_CLKIN1_PTA20 KINETIS_MUX('A',20,4)
#define FTM_CLKIN1_PTB17 KINETIS_MUX('B',17,4)
#define FTM_CLKIN1_PTC13 KINETIS_MUX('C',13,4)
#define FTM_CLKIN1_PTE17 KINETIS_MUX('E',17,4)
#define FXIO0_D0_PTB0 KINETIS_MUX('B',0,7)
#define FXIO0_D10_PTA0 KINETIS_MUX('A',0,5)
#define FXIO0_D10_PTB22 KINETIS_MUX('B',22,7)
#define FXIO0_D11_PTA1 KINETIS_MUX('A',1,5)
#define FXIO0_D11_PTB23 KINETIS_MUX('B',23,7)
#define FXIO0_D12_PTA2 KINETIS_MUX('A',2,5)
#define FXIO0_D12_PTC0 KINETIS_MUX('C',0,7)
#define FXIO0_D13_PTA3 KINETIS_MUX('A',3,5)
#define FXIO0_D13_PTC1 KINETIS_MUX('C',1,7)
#define FXIO0_D14_PTA4 KINETIS_MUX('A',4,5)
#define FXIO0_D14_PTC6 KINETIS_MUX('C',6,7)
#define FXIO0_D15_PTA5 KINETIS_MUX('A',5,5)
#define FXIO0_D15_PTC7 KINETIS_MUX('C',7,7)
#define FXIO0_D16_PTA10 KINETIS_MUX('A',10,5)
#define FXIO0_D16_PTC8 KINETIS_MUX('C',8,7)
#define FXIO0_D17_PTA11 KINETIS_MUX('A',11,5)
#define FXIO0_D17_PTC9 KINETIS_MUX('C',9,7)
#define FXIO0_D18_PTA12 KINETIS_MUX('A',12,5)
#define FXIO0_D18_PTC10 KINETIS_MUX('C',10,7)
#define FXIO0_D19_PTA13 KINETIS_MUX('A',13,5)
#define FXIO0_D19_PTC11 KINETIS_MUX('C',11,7)
#define FXIO0_D1_PTB1 KINETIS_MUX('B',1,7)
#define FXIO0_D20_PTA14 KINETIS_MUX('A',14,5)
#define FXIO0_D20_PTC14 KINETIS_MUX('C',14,7)
#define FXIO0_D21_PTA15 KINETIS_MUX('A',15,5)
#define FXIO0_D21_PTC15 KINETIS_MUX('C',15,7)
#define FXIO0_D22_PTA16 KINETIS_MUX('A',16,5)
#define FXIO0_D22_PTD0 KINETIS_MUX('D',0,7)
#define FXIO0_D23_PTA17 KINETIS_MUX('A',17,5)
#define FXIO0_D23_PTD1 KINETIS_MUX('D',1,7)
#define FXIO0_D24_PTD8 KINETIS_MUX('D',8,7)
#define FXIO0_D25_PTD9 KINETIS_MUX('D',9,7)
#define FXIO0_D26_PTD10 KINETIS_MUX('D',10,7)
#define FXIO0_D27_PTD11 KINETIS_MUX('D',11,7)
#define FXIO0_D28_PTD12 KINETIS_MUX('D',12,7)
#define FXIO0_D29_PTD13 KINETIS_MUX('D',13,7)
#define FXIO0_D2_PTB2 KINETIS_MUX('B',2,7)
#define FXIO0_D2_PTE12 KINETIS_MUX('E',12,7)
#define FXIO0_D30_PTD14 KINETIS_MUX('D',14,7)
#define FXIO0_D31_PTD15 KINETIS_MUX('D',15,7)
#define FXIO0_D3_PTB3 KINETIS_MUX('B',3,7)
#define FXIO0_D3_PTE13 KINETIS_MUX('E',13,7)
#define FXIO0_D4_PTB10 KINETIS_MUX('B',10,7)
#define FXIO0_D4_PTE16 KINETIS_MUX('E',16,7)
#define FXIO0_D5_PTB11 KINETIS_MUX('B',11,7)
#define FXIO0_D5_PTE17 KINETIS_MUX('E',17,7)
#define FXIO0_D6_PTB18 KINETIS_MUX('B',18,7)
#define FXIO0_D6_PTE18 KINETIS_MUX('E',18,7)
#define FXIO0_D7_PTB19 KINETIS_MUX('B',19,7)
#define FXIO0_D7_PTE19 KINETIS_MUX('E',19,7)
#define FXIO0_D8_PTA20 KINETIS_MUX('A',20,5)
#define FXIO0_D8_PTB20 KINETIS_MUX('B',20,7)
#define FXIO0_D9_PTA21 KINETIS_MUX('A',21,5)
#define FXIO0_D9_PTB21 KINETIS_MUX('B',21,7)
#define I2C0_SCL_PTA20 KINETIS_MUX('A',20,2)
#define I2C0_SCL_PTB0 KINETIS_MUX('B',0,2)
#define I2C0_SCL_PTB2 KINETIS_MUX('B',2,2)
#define I2C0_SCL_PTD2 KINETIS_MUX('D',2,7)
#define I2C0_SCL_PTD8 KINETIS_MUX('D',8,2)
#define I2C0_SCL_PTE19 KINETIS_MUX('E',19,4)
#define I2C0_SDA_PTA21 KINETIS_MUX('A',21,2)
#define I2C0_SDA_PTB1 KINETIS_MUX('B',1,2)
#define I2C0_SDA_PTB3 KINETIS_MUX('B',3,2)
#define I2C0_SDA_PTD3 KINETIS_MUX('D',3,7)
#define I2C0_SDA_PTD9 KINETIS_MUX('D',9,2)
#define I2C0_SDA_PTE18 KINETIS_MUX('E',18,4)
#define I2C1_SCL_PTC10 KINETIS_MUX('C',10,2)
#define I2C1_SCL_PTE1 KINETIS_MUX('E',1,6)
#define I2C1_SDA_PTC11 KINETIS_MUX('C',11,2)
#define I2C1_SDA_PTE0 KINETIS_MUX('E',0,6)
#define I2C2_SCL_PTA11 KINETIS_MUX('A',11,2)
#define I2C2_SCL_PTA6 KINETIS_MUX('A',6,2)
#define I2C2_SCL_PTB10 KINETIS_MUX('B',10,4)
#define I2C2_SDA_PTA10 KINETIS_MUX('A',10,2)
#define I2C2_SDA_PTA7 KINETIS_MUX('A',7,2)
#define I2C2_SDA_PTB11 KINETIS_MUX('B',11,4)
#define I2C3_SCL_PTA2 KINETIS_MUX('A',2,4)
#define I2C3_SCL_PTE11 KINETIS_MUX('E',11,2)
#define I2C3_SDA_PTA1 KINETIS_MUX('A',1,4)
#define I2C3_SDA_PTE10 KINETIS_MUX('E',10,2)
#define I2S0_MCLK_PTA17 KINETIS_MUX('A',17,6)
#define I2S0_MCLK_PTC6 KINETIS_MUX('C',6,6)
#define I2S0_MCLK_PTC8 KINETIS_MUX('C',8,4)
#define I2S0_MCLK_PTE6 KINETIS_MUX('E',6,4)
#define I2S0_RXD0_PTA15 KINETIS_MUX('A',15,6)
#define I2S0_RXD0_PTC5 KINETIS_MUX('C',5,4)
#define I2S0_RXD0_PTE7 KINETIS_MUX('E',7,4)
#define I2S0_RXD1_PTA16 KINETIS_MUX('A',16,7)
#define I2S0_RXD1_PTC11 KINETIS_MUX('C',11,4)
#define I2S0_RXD1_PTE8 KINETIS_MUX('E',8,2)
#define I2S0_RX_BCLK_PTA14 KINETIS_MUX('A',14,6)
#define I2S0_RX_BCLK_PTC6 KINETIS_MUX('C',6,4)
#define I2S0_RX_BCLK_PTC9 KINETIS_MUX('C',9,4)
#define I2S0_RX_BCLK_PTE9 KINETIS_MUX('E',9,4)
#define I2S0_RX_FS_PTA16 KINETIS_MUX('A',16,6)
#define I2S0_RX_FS_PTC10 KINETIS_MUX('C',10,4)
#define I2S0_RX_FS_PTC7 KINETIS_MUX('C',7,4)
#define I2S0_RX_FS_PTE8 KINETIS_MUX('E',8,4)
#define I2S0_TXD0_PTA12 KINETIS_MUX('A',12,6)
#define I2S0_TXD0_PTC1 KINETIS_MUX('C',1,6)
#define I2S0_TXD0_PTE10 KINETIS_MUX('E',10,4)
#define I2S0_TXD1_PTA14 KINETIS_MUX('A',14,7)
#define I2S0_TXD1_PTC0 KINETIS_MUX('C',0,6)
#define I2S0_TXD1_PTE9 KINETIS_MUX('E',9,2)
#define I2S0_TX_BCLK_PTA5 KINETIS_MUX('A',5,6)
#define I2S0_TX_BCLK_PTB18 KINETIS_MUX('B',18,4)
#define I2S0_TX_BCLK_PTC3 KINETIS_MUX('C',3,6)
#define I2S0_TX_BCLK_PTE12 KINETIS_MUX('E',12,4)
#define I2S0_TX_FS_PTA13 KINETIS_MUX('A',13,6)
#define I2S0_TX_FS_PTB19 KINETIS_MUX('B',19,4)
#define I2S0_TX_FS_PTC2 KINETIS_MUX('C',2,6)
#define I2S0_TX_FS_PTE11 KINETIS_MUX('E',11,4)
#define JTAG_TCLK_PTA0 KINETIS_MUX('A',0,7)
#define JTAG_TDI_PTA1 KINETIS_MUX('A',1,7)
#define JTAG_TDO_PTA2 KINETIS_MUX('A',2,7)
#define JTAG_TMS_PTA3 KINETIS_MUX('A',3,7)
#define JTAG_TRST_b_PTA5 KINETIS_MUX('A',5,7)
#define KINETIS_MUX(port, pin, mux)		 (((((port) - 'A') & 0xF) << 28) |	 (((pin) & 0x3F) << 22) |		 (((mux) & 0x7) << 8))
#define LLWU_P0_PTE1 KINETIS_MUX('E',1,1)
#define LLWU_P10_PTC6 KINETIS_MUX('C',6,1)
#define LLWU_P11_PTC11 KINETIS_MUX('C',11,1)
#define LLWU_P12_PTD0 KINETIS_MUX('D',0,1)
#define LLWU_P13_PTD2 KINETIS_MUX('D',2,1)
#define LLWU_P14_PTD4 KINETIS_MUX('D',4,1)
#define LLWU_P15_PTD6 KINETIS_MUX('D',6,1)
#define LLWU_P16_PTE6 KINETIS_MUX('E',6,1)
#define LLWU_P17_PTE9 KINETIS_MUX('E',9,1)
#define LLWU_P18_PTE10 KINETIS_MUX('E',10,1)
#define LLWU_P19_PTE17 KINETIS_MUX('E',17,1)
#define LLWU_P1_PTE2 KINETIS_MUX('E',2,1)
#define LLWU_P20_PTE18 KINETIS_MUX('E',18,1)
#define LLWU_P21_PTA21 KINETIS_MUX('A',21,1)
#define LLWU_P22_PTA10 KINETIS_MUX('A',10,1)
#define LLWU_P23_PTA11 KINETIS_MUX('A',11,1)
#define LLWU_P24_PTD8 KINETIS_MUX('D',8,1)
#define LLWU_P25_PTD11 KINETIS_MUX('D',11,1)
#define LLWU_P2_PTE4 KINETIS_MUX('E',4,1)
#define LLWU_P3_PTA4 KINETIS_MUX('A',4,1)
#define LLWU_P4_PTA13 KINETIS_MUX('A',13,1)
#define LLWU_P5_PTB0 KINETIS_MUX('B',0,1)
#define LLWU_P6_PTC1 KINETIS_MUX('C',1,1)
#define LLWU_P7_PTC3 KINETIS_MUX('C',3,1)
#define LLWU_P8_PTC4 KINETIS_MUX('C',4,1)
#define LLWU_P9_PTC5 KINETIS_MUX('C',5,1)
#define LPTMR0_ALT1_PTA19 KINETIS_MUX('A',19,6)
#define LPTMR0_ALT2_PTC5 KINETIS_MUX('C',5,3)
#define LPTMR0_ALT3_PTE17 KINETIS_MUX('E',17,6)
#define LPTMR1_ALT1_PTA19 KINETIS_MUX('A',19,6)
#define LPTMR1_ALT2_PTC5 KINETIS_MUX('C',5,3)
#define LPUART0_CTS_b_PTA0 KINETIS_MUX('A',0,2)
#define LPUART0_CTS_b_PTA16 KINETIS_MUX('A',16,3)
#define LPUART0_CTS_b_PTB3 KINETIS_MUX('B',3,3)
#define LPUART0_CTS_b_PTD5 KINETIS_MUX('D',5,3)
#define LPUART0_RTS_b_PTA17 KINETIS_MUX('A',17,3)
#define LPUART0_RTS_b_PTA3 KINETIS_MUX('A',3,2)
#define LPUART0_RTS_b_PTB2 KINETIS_MUX('B',2,3)
#define LPUART0_RTS_b_PTD4 KINETIS_MUX('D',4,3)
#define LPUART0_RX_PTA1 KINETIS_MUX('A',1,2)
#define LPUART0_RX_PTA15 KINETIS_MUX('A',15,3)
#define LPUART0_RX_PTB16 KINETIS_MUX('B',16,3)
#define LPUART0_RX_PTD6 KINETIS_MUX('D',6,3)
#define LPUART0_TX_PTA14 KINETIS_MUX('A',14,3)
#define LPUART0_TX_PTA2 KINETIS_MUX('A',2,2)
#define LPUART0_TX_PTB17 KINETIS_MUX('B',17,3)
#define LPUART0_TX_PTD7 KINETIS_MUX('D',7,3)
#define LPUART1_CTS_b_PTC2 KINETIS_MUX('C',2,3)
#define LPUART1_CTS_b_PTE2 KINETIS_MUX('E',2,3)
#define LPUART1_RTS_b_PTC1 KINETIS_MUX('C',1,3)
#define LPUART1_RTS_b_PTE3 KINETIS_MUX('E',3,3)
#define LPUART1_RX_PTC3 KINETIS_MUX('C',3,3)
#define LPUART1_RX_PTE1 KINETIS_MUX('E',1,3)
#define LPUART1_TX_PTC4 KINETIS_MUX('C',4,3)
#define LPUART1_TX_PTE0 KINETIS_MUX('E',0,3)
#define LPUART2_CTS_b_PTD1 KINETIS_MUX('D',1,3)
#define LPUART2_CTS_b_PTE18 KINETIS_MUX('E',18,3)
#define LPUART2_RTS_b_PTD0 KINETIS_MUX('D',0,3)
#define LPUART2_RTS_b_PTE19 KINETIS_MUX('E',19,3)
#define LPUART2_RX_PTD2 KINETIS_MUX('D',2,3)
#define LPUART2_RX_PTE13 KINETIS_MUX('E',13,3)
#define LPUART2_RX_PTE17 KINETIS_MUX('E',17,3)
#define LPUART2_TX_PTD3 KINETIS_MUX('D',3,3)
#define LPUART2_TX_PTE12 KINETIS_MUX('E',12,3)
#define LPUART2_TX_PTE16 KINETIS_MUX('E',16,3)
#define LPUART3_CTS_b_PTB9 KINETIS_MUX('B',9,3)
#define LPUART3_CTS_b_PTC19 KINETIS_MUX('C',19,3)
#define LPUART3_CTS_b_PTE6 KINETIS_MUX('E',6,3)
#define LPUART3_RTS_b_PTB8 KINETIS_MUX('B',8,3)
#define LPUART3_RTS_b_PTC18 KINETIS_MUX('C',18,3)
#define LPUART3_RTS_b_PTE7 KINETIS_MUX('E',7,3)
#define LPUART3_RX_PTB10 KINETIS_MUX('B',10,3)
#define LPUART3_RX_PTC16 KINETIS_MUX('C',16,3)
#define LPUART3_RX_PTE5 KINETIS_MUX('E',5,3)
#define LPUART3_TX_PTB11 KINETIS_MUX('B',11,3)
#define LPUART3_TX_PTC17 KINETIS_MUX('C',17,3)
#define LPUART3_TX_PTE4 KINETIS_MUX('E',4,3)
#define LPUART4_CTS_b_PTC13 KINETIS_MUX('C',13,3)
#define LPUART4_RTS_b_PTC12 KINETIS_MUX('C',12,3)
#define LPUART4_RX_PTA21 KINETIS_MUX('A',21,3)
#define LPUART4_RX_PTC14 KINETIS_MUX('C',14,3)
#define LPUART4_TX_PTA20 KINETIS_MUX('A',20,3)
#define LPUART4_TX_PTC15 KINETIS_MUX('C',15,3)
#define NMI_b_PTA4 KINETIS_MUX('A',4,7)
#define PDB0_EXTRG_PTC0 KINETIS_MUX('C',0,3)
#define PDB0_EXTRG_PTC6 KINETIS_MUX('C',6,3)
#define PTA0 KINETIS_MUX('A',0,1)
#define PTA1 KINETIS_MUX('A',1,1)
#define PTA10 KINETIS_MUX('A',10,1)
#define PTA11 KINETIS_MUX('A',11,1)
#define PTA12 KINETIS_MUX('A',12,1)
#define PTA13 KINETIS_MUX('A',13,1)
#define PTA14 KINETIS_MUX('A',14,1)
#define PTA15 KINETIS_MUX('A',15,1)
#define PTA16 KINETIS_MUX('A',16,1)
#define PTA17 KINETIS_MUX('A',17,1)
#define PTA18 KINETIS_MUX('A',18,1)
#define PTA19 KINETIS_MUX('A',19,1)
#define PTA2 KINETIS_MUX('A',2,1)
#define PTA20 KINETIS_MUX('A',20,1)
#define PTA21 KINETIS_MUX('A',21,1)
#define PTA24 KINETIS_MUX('A',24,1)
#define PTA25 KINETIS_MUX('A',25,1)
#define PTA26 KINETIS_MUX('A',26,1)
#define PTA27 KINETIS_MUX('A',27,1)
#define PTA28 KINETIS_MUX('A',28,1)
#define PTA29 KINETIS_MUX('A',29,1)
#define PTA3 KINETIS_MUX('A',3,1)
#define PTA4 KINETIS_MUX('A',4,1)
#define PTA5 KINETIS_MUX('A',5,1)
#define PTA6 KINETIS_MUX('A',6,1)
#define PTA7 KINETIS_MUX('A',7,1)
#define PTA8 KINETIS_MUX('A',8,1)
#define PTA9 KINETIS_MUX('A',9,1)
#define PTB0 KINETIS_MUX('B',0,1)
#define PTB1 KINETIS_MUX('B',1,1)
#define PTB10 KINETIS_MUX('B',10,1)
#define PTB11 KINETIS_MUX('B',11,1)
#define PTB16 KINETIS_MUX('B',16,1)
#define PTB17 KINETIS_MUX('B',17,1)
#define PTB18 KINETIS_MUX('B',18,1)
#define PTB19 KINETIS_MUX('B',19,1)
#define PTB2 KINETIS_MUX('B',2,1)
#define PTB20 KINETIS_MUX('B',20,1)
#define PTB21 KINETIS_MUX('B',21,1)
#define PTB22 KINETIS_MUX('B',22,1)
#define PTB23 KINETIS_MUX('B',23,1)
#define PTB3 KINETIS_MUX('B',3,1)
#define PTB4 KINETIS_MUX('B',4,1)
#define PTB5 KINETIS_MUX('B',5,1)
#define PTB6 KINETIS_MUX('B',6,1)
#define PTB7 KINETIS_MUX('B',7,1)
#define PTB8 KINETIS_MUX('B',8,1)
#define PTB9 KINETIS_MUX('B',9,1)
#define PTC0 KINETIS_MUX('C',0,1)
#define PTC1 KINETIS_MUX('C',1,1)
#define PTC10 KINETIS_MUX('C',10,1)
#define PTC11 KINETIS_MUX('C',11,1)
#define PTC12 KINETIS_MUX('C',12,1)
#define PTC13 KINETIS_MUX('C',13,1)
#define PTC14 KINETIS_MUX('C',14,1)
#define PTC15 KINETIS_MUX('C',15,1)
#define PTC16 KINETIS_MUX('C',16,1)
#define PTC17 KINETIS_MUX('C',17,1)
#define PTC18 KINETIS_MUX('C',18,1)
#define PTC19 KINETIS_MUX('C',19,1)
#define PTC2 KINETIS_MUX('C',2,1)
#define PTC3 KINETIS_MUX('C',3,1)
#define PTC4 KINETIS_MUX('C',4,1)
#define PTC5 KINETIS_MUX('C',5,1)
#define PTC6 KINETIS_MUX('C',6,1)
#define PTC7 KINETIS_MUX('C',7,1)
#define PTC8 KINETIS_MUX('C',8,1)
#define PTC9 KINETIS_MUX('C',9,1)
#define PTD0 KINETIS_MUX('D',0,1)
#define PTD1 KINETIS_MUX('D',1,1)
#define PTD10 KINETIS_MUX('D',10,1)
#define PTD11 KINETIS_MUX('D',11,1)
#define PTD12 KINETIS_MUX('D',12,1)
#define PTD13 KINETIS_MUX('D',13,1)
#define PTD14 KINETIS_MUX('D',14,1)
#define PTD15 KINETIS_MUX('D',15,1)
#define PTD2 KINETIS_MUX('D',2,1)
#define PTD3 KINETIS_MUX('D',3,1)
#define PTD4 KINETIS_MUX('D',4,1)
#define PTD5 KINETIS_MUX('D',5,1)
#define PTD6 KINETIS_MUX('D',6,1)
#define PTD7 KINETIS_MUX('D',7,1)
#define PTD8 KINETIS_MUX('D',8,1)
#define PTD9 KINETIS_MUX('D',9,1)
#define PTE0 KINETIS_MUX('E',0,1)
#define PTE1 KINETIS_MUX('E',1,1)
#define PTE10 KINETIS_MUX('E',10,1)
#define PTE11 KINETIS_MUX('E',11,1)
#define PTE12 KINETIS_MUX('E',12,1)
#define PTE13 KINETIS_MUX('E',13,1)
#define PTE16 KINETIS_MUX('E',16,1)
#define PTE17 KINETIS_MUX('E',17,1)
#define PTE18 KINETIS_MUX('E',18,1)
#define PTE19 KINETIS_MUX('E',19,1)
#define PTE2 KINETIS_MUX('E',2,1)
#define PTE3 KINETIS_MUX('E',3,1)
#define PTE4 KINETIS_MUX('E',4,1)
#define PTE5 KINETIS_MUX('E',5,1)
#define PTE6 KINETIS_MUX('E',6,1)
#define PTE7 KINETIS_MUX('E',7,1)
#define PTE8 KINETIS_MUX('E',8,1)
#define PTE9 KINETIS_MUX('E',9,1)
#define QSPI0A_DATA0_PTE2 KINETIS_MUX('E',2,5)
#define QSPI0A_DATA1_PTE4 KINETIS_MUX('E',4,5)
#define QSPI0A_DATA2_PTE3 KINETIS_MUX('E',3,5)
#define QSPI0A_DATA3_PTE0 KINETIS_MUX('E',0,5)
#define QSPI0A_DQS_PTE11 KINETIS_MUX('E',11,7)
#define QSPI0A_SCLK_PTE1 KINETIS_MUX('E',1,5)
#define QSPI0A_SS0_B_PTE5 KINETIS_MUX('E',5,5)
#define QSPI0A_SS1_B_PTE7 KINETIS_MUX('E',7,7)
#define QSPI0B_DATA0_PTE8 KINETIS_MUX('E',8,5)
#define QSPI0B_DATA1_PTE10 KINETIS_MUX('E',10,5)
#define QSPI0B_DATA2_PTE9 KINETIS_MUX('E',9,5)
#define QSPI0B_DATA3_PTE6 KINETIS_MUX('E',6,5)
#define QSPI0B_DQS_PTE12 KINETIS_MUX('E',12,5)
#define QSPI0B_SCLK_PTE7 KINETIS_MUX('E',7,5)
#define QSPI0B_SS0_B_PTE11 KINETIS_MUX('E',11,5)
#define QSPI0B_SS1_B_PTE13 KINETIS_MUX('E',13,5)
#define RTC_CLKOUT_PTE0 KINETIS_MUX('E',0,7)
#define SDHC0_CLKIN_PTE13 KINETIS_MUX('E',13,6)
#define SDHC0_CMD_PTE3 KINETIS_MUX('E',3,4)
#define SDHC0_D0_PTE1 KINETIS_MUX('E',1,4)
#define SDHC0_D1_PTE0 KINETIS_MUX('E',0,4)
#define SDHC0_D2_PTE5 KINETIS_MUX('E',5,4)
#define SDHC0_D3_PTE4 KINETIS_MUX('E',4,4)
#define SDHC0_D4_PTE6 KINETIS_MUX('E',6,7)
#define SDHC0_D5_PTE8 KINETIS_MUX('E',8,7)
#define SDHC0_D6_PTE9 KINETIS_MUX('E',9,7)
#define SDHC0_D7_PTE10 KINETIS_MUX('E',10,7)
#define SDHC0_DCLK_PTE2 KINETIS_MUX('E',2,4)
#define SDRAM_A10_PTD4 KINETIS_MUX('D',4,5)
#define SDRAM_A11_PTD3 KINETIS_MUX('D',3,5)
#define SDRAM_A12_PTD2 KINETIS_MUX('D',2,5)
#define SDRAM_A13_PTC10 KINETIS_MUX('C',10,5)
#define SDRAM_A14_PTC9 KINETIS_MUX('C',9,5)
#define SDRAM_A15_PTC8 KINETIS_MUX('C',8,5)
#define SDRAM_A16_PTC7 KINETIS_MUX('C',7,5)
#define SDRAM_A17_PTC6 KINETIS_MUX('C',6,5)
#define SDRAM_A18_PTC5 KINETIS_MUX('C',5,5)
#define SDRAM_A19_PTC4 KINETIS_MUX('C',4,5)
#define SDRAM_A20_PTC2 KINETIS_MUX('C',2,5)
#define SDRAM_A21_PTC1 KINETIS_MUX('C',1,5)
#define SDRAM_A22_PTC0 KINETIS_MUX('C',0,5)
#define SDRAM_A23_PTB18 KINETIS_MUX('B',18,5)
#define SDRAM_A9_PTD5 KINETIS_MUX('D',5,5)
#define SDRAM_CAS_b_PTB0 KINETIS_MUX('B',0,5)
#define SDRAM_CKE_PTD7 KINETIS_MUX('D',7,5)
#define SDRAM_CS0_b_PTB3 KINETIS_MUX('B',3,5)
#define SDRAM_CS1_b_PTB4 KINETIS_MUX('B',4,5)
#define SDRAM_D16_PTB17 KINETIS_MUX('B',17,5)
#define SDRAM_D17_PTB16 KINETIS_MUX('B',16,5)
#define SDRAM_D18_PTB11 KINETIS_MUX('B',11,5)
#define SDRAM_D19_PTB10 KINETIS_MUX('B',10,5)
#define SDRAM_D20_PTB9 KINETIS_MUX('B',9,5)
#define SDRAM_D21_PTB8 KINETIS_MUX('B',8,5)
#define SDRAM_D22_PTB7 KINETIS_MUX('B',7,5)
#define SDRAM_D23_PTB6 KINETIS_MUX('B',6,5)
#define SDRAM_D24_PTC15 KINETIS_MUX('C',15,5)
#define SDRAM_D25_PTC14 KINETIS_MUX('C',14,5)
#define SDRAM_D26_PTC13 KINETIS_MUX('C',13,5)
#define SDRAM_D27_PTC12 KINETIS_MUX('C',12,5)
#define SDRAM_D28_PTB23 KINETIS_MUX('B',23,5)
#define SDRAM_D29_PTB22 KINETIS_MUX('B',22,5)
#define SDRAM_D30_PTB21 KINETIS_MUX('B',21,5)
#define SDRAM_D31_PTB20 KINETIS_MUX('B',20,5)
#define SDRAM_DQM0_PTC19 KINETIS_MUX('C',19,5)
#define SDRAM_DQM1_PTC18 KINETIS_MUX('C',18,5)
#define SDRAM_DQM2_PTC16 KINETIS_MUX('C',16,5)
#define SDRAM_DQM3_PTC17 KINETIS_MUX('C',17,5)
#define SDRAM_RAS_b_PTB1 KINETIS_MUX('B',1,5)
#define SPI0_PCS0_PTA14 KINETIS_MUX('A',14,2)
#define SPI0_PCS0_PTC4 KINETIS_MUX('C',4,2)
#define SPI0_PCS0_PTD0 KINETIS_MUX('D',0,2)
#define SPI0_PCS0_PTE16 KINETIS_MUX('E',16,2)
#define SPI0_PCS1_PTC3 KINETIS_MUX('C',3,2)
#define SPI0_PCS1_PTD4 KINETIS_MUX('D',4,2)
#define SPI0_PCS2_PTC2 KINETIS_MUX('C',2,2)
#define SPI0_PCS2_PTD5 KINETIS_MUX('D',5,2)
#define SPI0_PCS3_PTC1 KINETIS_MUX('C',1,2)
#define SPI0_PCS3_PTD6 KINETIS_MUX('D',6,2)
#define SPI0_PCS4_PTC0 KINETIS_MUX('C',0,2)
#define SPI0_PCS5_PTB23 KINETIS_MUX('B',23,3)
#define SPI0_SCK_PTA15 KINETIS_MUX('A',15,2)
#define SPI0_SCK_PTC5 KINETIS_MUX('C',5,2)
#define SPI0_SCK_PTD1 KINETIS_MUX('D',1,2)
#define SPI0_SCK_PTE17 KINETIS_MUX('E',17,2)
#define SPI0_SIN_PTA17 KINETIS_MUX('A',17,2)
#define SPI0_SIN_PTC7 KINETIS_MUX('C',7,2)
#define SPI0_SIN_PTD3 KINETIS_MUX('D',3,2)
#define SPI0_SIN_PTE19 KINETIS_MUX('E',19,2)
#define SPI0_SOUT_PTA16 KINETIS_MUX('A',16,2)
#define SPI0_SOUT_PTC6 KINETIS_MUX('C',6,2)
#define SPI0_SOUT_PTD2 KINETIS_MUX('D',2,2)
#define SPI0_SOUT_PTE18 KINETIS_MUX('E',18,2)
#define SPI1_PCS0_PTB10 KINETIS_MUX('B',10,2)
#define SPI1_PCS0_PTD4 KINETIS_MUX('D',4,7)
#define SPI1_PCS0_PTE5 KINETIS_MUX('E',5,2)
#define SPI1_PCS1_PTB9 KINETIS_MUX('B',9,2)
#define SPI1_PCS1_PTE0 KINETIS_MUX('E',0,2)
#define SPI1_PCS2_PTE3 KINETIS_MUX('E',3,2)
#define SPI1_SCK_PTB11 KINETIS_MUX('B',11,2)
#define SPI1_SCK_PTD5 KINETIS_MUX('D',5,7)
#define SPI1_SCK_PTE1 KINETIS_MUX('E',1,2)
#define SPI1_SCK_PTE2 KINETIS_MUX('E',2,7)
#define SPI1_SIN_PTB17 KINETIS_MUX('B',17,2)
#define SPI1_SIN_PTD7 KINETIS_MUX('D',7,7)
#define SPI1_SIN_PTE1 KINETIS_MUX('E',1,7)
#define SPI1_SIN_PTE4 KINETIS_MUX('E',4,2)
#define SPI1_SOUT_PTB16 KINETIS_MUX('B',16,2)
#define SPI1_SOUT_PTD6 KINETIS_MUX('D',6,7)
#define SPI1_SOUT_PTE2 KINETIS_MUX('E',2,2)
#define SPI1_SOUT_PTE3 KINETIS_MUX('E',3,7)
#define SPI2_PCS0_PTB20 KINETIS_MUX('B',20,2)
#define SPI2_PCS0_PTD11 KINETIS_MUX('D',11,2)
#define SPI2_PCS1_PTD15 KINETIS_MUX('D',15,2)
#define SPI2_SCK_PTB21 KINETIS_MUX('B',21,2)
#define SPI2_SCK_PTD12 KINETIS_MUX('D',12,2)
#define SPI2_SIN_PTB23 KINETIS_MUX('B',23,2)
#define SPI2_SIN_PTD14 KINETIS_MUX('D',14,2)
#define SPI2_SOUT_PTB22 KINETIS_MUX('B',22,2)
#define SPI2_SOUT_PTD13 KINETIS_MUX('D',13,2)
#define TPM1_CH0_PTA12 KINETIS_MUX('A',12,7)
#define TPM1_CH0_PTA8 KINETIS_MUX('A',8,6)
#define TPM1_CH0_PTB0 KINETIS_MUX('B',0,6)
#define TPM1_CH1_PTA13 KINETIS_MUX('A',13,7)
#define TPM1_CH1_PTA9 KINETIS_MUX('A',9,6)
#define TPM1_CH1_PTB1 KINETIS_MUX('B',1,6)
#define TPM2_CH0_PTA10 KINETIS_MUX('A',10,6)
#define TPM2_CH0_PTB18 KINETIS_MUX('B',18,6)
#define TPM2_CH1_PTA11 KINETIS_MUX('A',11,6)
#define TPM2_CH1_PTB19 KINETIS_MUX('B',19,6)
#define TPM_CLKIN0_PTA18 KINETIS_MUX('A',18,7)
