zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/k2x/pinctrl/MK28FN2M0VMI15-pinctrl.h
#define TPM_CLKIN0_PTB16 KINETIS_MUX('B',16,7)
#define TPM_CLKIN0_PTC12 KINETIS_MUX('C',12,7)
#define TPM_CLKIN1_PTA19 KINETIS_MUX('A',19,7)
#define TPM_CLKIN1_PTA20 KINETIS_MUX('A',20,7)
#define TPM_CLKIN1_PTB17 KINETIS_MUX('B',17,7)
#define TPM_CLKIN1_PTC13 KINETIS_MUX('C',13,7)
#define TRACE_CLKOUT_PTA12 KINETIS_MUX('A',12,4)
#define TRACE_CLKOUT_PTA6 KINETIS_MUX('A',6,7)
#define TRACE_D0_PTA10 KINETIS_MUX('A',10,7)
#define TRACE_D0_PTA16 KINETIS_MUX('A',16,4)
#define TRACE_D1_PTA15 KINETIS_MUX('A',15,4)
#define TRACE_D1_PTA9 KINETIS_MUX('A',9,7)
#define TRACE_D2_PTA14 KINETIS_MUX('A',14,4)
#define TRACE_D2_PTA8 KINETIS_MUX('A',8,7)
#define TRACE_D3_PTA13 KINETIS_MUX('A',13,4)
#define TRACE_D3_PTA7 KINETIS_MUX('A',7,7)
#define TRACE_SWO_PTA2 KINETIS_MUX('A',2,7)
#define USB0_CLKIN_PTA5 KINETIS_MUX('A',5,2)
#define USB0_SOF_OUT_PTC0 KINETIS_MUX('C',0,4)
#define USB0_SOF_OUT_PTC7 KINETIS_MUX('C',7,3)
#define USB0_SOF_OUT_PTE5 KINETIS_MUX('E',5,7)
#define XTAL0_PTA19 KINETIS_MUX('A',19,0)
#define FTM0_CH4_PTB12 KINETIS_MUX('B',12,4)
#define FTM0_CH5_PTB13 KINETIS_MUX('B',13,4)
#define FTM1_CH0_PTB12 KINETIS_MUX('B',12,3)
#define FTM1_CH1_PTB13 KINETIS_MUX('B',13,3)
#define FTM1_QD_PHA_PTB12 KINETIS_MUX('B',12,6)
#define FTM1_QD_PHB_PTB13 KINETIS_MUX('B',13,6)
#define FXIO0_D0_PTE2 KINETIS_MUX('E',2,6)
#define FXIO0_D10_PTE22 KINETIS_MUX('E',22,7)
#define FXIO0_D11_PTE23 KINETIS_MUX('E',23,7)
#define FXIO0_D12_PTE6 KINETIS_MUX('E',6,2)
#define FXIO0_D13_PTE7 KINETIS_MUX('E',7,2)
#define FXIO0_D14_PTE8 KINETIS_MUX('E',8,3)
#define FXIO0_D15_PTE9 KINETIS_MUX('E',9,3)
#define FXIO0_D16_PTE10 KINETIS_MUX('E',10,3)
#define FXIO0_D17_PTE11 KINETIS_MUX('E',11,3)
#define FXIO0_D1_PTE3 KINETIS_MUX('E',3,6)
#define FXIO0_D6_PTA22 KINETIS_MUX('A',22,5)
#define FXIO0_D7_PTA23 KINETIS_MUX('A',23,5)
#define FXIO0_D8_PTE20 KINETIS_MUX('E',20,7)
#define FXIO0_D9_PTE21 KINETIS_MUX('E',21,7)
#define I2C1_SCL_PTA8 KINETIS_MUX('A',8,2)
#define I2C1_SDA_PTA9 KINETIS_MUX('A',9,2)
#define I2C2_SCL_PTE23 KINETIS_MUX('E',23,2)
#define I2C2_SDA_PTE22 KINETIS_MUX('E',22,2)
#define I2C3_SCL_PTA31 KINETIS_MUX('A',31,2)
#define I2C3_SCL_PTC29 KINETIS_MUX('C',29,2)
#define I2C3_SDA_PTA30 KINETIS_MUX('A',30,2)
#define I2C3_SDA_PTC28 KINETIS_MUX('C',28,2)
#define I2S1_MCLK_PTA17 KINETIS_MUX('A',17,7)
#define I2S1_MCLK_PTE13 KINETIS_MUX('E',13,4)
#define I2S1_RXD0_PTA29 KINETIS_MUX('A',29,7)
#define I2S1_RXD0_PTE21 KINETIS_MUX('E',21,5)
#define I2S1_RXD1_PTA28 KINETIS_MUX('A',28,7)
#define I2S1_RXD1_PTE20 KINETIS_MUX('E',20,5)
#define I2S1_RX_BCLK_PTA31 KINETIS_MUX('A',31,7)
#define I2S1_RX_BCLK_PTE23 KINETIS_MUX('E',23,5)
#define I2S1_RX_FS_PTA30 KINETIS_MUX('A',30,7)
#define I2S1_RX_FS_PTE22 KINETIS_MUX('E',22,5)
#define I2S1_TXD0_PTA26 KINETIS_MUX('A',26,7)
#define I2S1_TXD0_PTE18 KINETIS_MUX('E',18,5)
#define I2S1_TXD1_PTA27 KINETIS_MUX('A',27,7)
#define I2S1_TXD1_PTE19 KINETIS_MUX('E',19,5)
#define I2S1_TX_BCLK_PTA24 KINETIS_MUX('A',24,7)
#define I2S1_TX_BCLK_PTE16 KINETIS_MUX('E',16,5)
#define I2S1_TX_FS_PTA25 KINETIS_MUX('A',25,7)
#define I2S1_TX_FS_PTE17 KINETIS_MUX('E',17,5)
#define LPUART0_CTS_b_PTB13 KINETIS_MUX('B',13,2)
#define LPUART0_CTS_b_PTC26 KINETIS_MUX('C',26,3)
#define LPUART0_RTS_b_PTB12 KINETIS_MUX('B',12,2)
#define LPUART0_RTS_b_PTC27 KINETIS_MUX('C',27,3)
#define LPUART0_RX_PTB14 KINETIS_MUX('B',14,2)
#define LPUART0_RX_PTC25 KINETIS_MUX('C',25,3)
#define LPUART0_TX_PTB15 KINETIS_MUX('B',15,2)
#define LPUART0_TX_PTC24 KINETIS_MUX('C',24,3)
#define LPUART1_CTS_b_PTD11 KINETIS_MUX('D',11,3)
#define LPUART1_RTS_b_PTD10 KINETIS_MUX('D',10,3)
#define LPUART1_RX_PTD8 KINETIS_MUX('D',8,3)
#define LPUART1_TX_PTD9 KINETIS_MUX('D',9,3)
#define LPUART2_CTS_b_PTA26 KINETIS_MUX('A',26,3)
#define LPUART2_RTS_b_PTA27 KINETIS_MUX('A',27,3)
#define LPUART2_RX_PTA25 KINETIS_MUX('A',25,3)
#define LPUART2_TX_PTA24 KINETIS_MUX('A',24,3)
#define LPUART3_CTS_b_PTA30 KINETIS_MUX('A',30,3)
#define LPUART3_RTS_b_PTA31 KINETIS_MUX('A',31,3)
#define LPUART3_RX_PTA29 KINETIS_MUX('A',29,3)
#define LPUART3_TX_PTA28 KINETIS_MUX('A',28,3)
#define LPUART4_CTS_b_PTA22 KINETIS_MUX('A',22,3)
#define LPUART4_CTS_b_PTE22 KINETIS_MUX('E',22,3)
#define LPUART4_RTS_b_PTA23 KINETIS_MUX('A',23,3)
#define LPUART4_RTS_b_PTE23 KINETIS_MUX('E',23,3)
#define LPUART4_RX_PTE21 KINETIS_MUX('E',21,3)
#define LPUART4_TX_PTE20 KINETIS_MUX('E',20,3)
#define PTA22 KINETIS_MUX('A',22,1)
#define PTA23 KINETIS_MUX('A',23,1)
#define PTA30 KINETIS_MUX('A',30,1)
#define PTA31 KINETIS_MUX('A',31,1)
#define PTB12 KINETIS_MUX('B',12,1)
#define PTB13 KINETIS_MUX('B',13,1)
#define PTB14 KINETIS_MUX('B',14,1)
#define PTB15 KINETIS_MUX('B',15,1)
#define PTC24 KINETIS_MUX('C',24,1)
#define PTC25 KINETIS_MUX('C',25,1)
#define PTC26 KINETIS_MUX('C',26,1)
#define PTC27 KINETIS_MUX('C',27,1)
#define PTC28 KINETIS_MUX('C',28,1)
#define PTC29 KINETIS_MUX('C',29,1)
#define PTE20 KINETIS_MUX('E',20,1)
#define PTE21 KINETIS_MUX('E',21,1)
#define PTE22 KINETIS_MUX('E',22,1)
#define PTE23 KINETIS_MUX('E',23,1)
#define QSPI0A_DATA0_PTC26 KINETIS_MUX('C',26,7)
#define QSPI0A_DATA1_PTC28 KINETIS_MUX('C',28,7)
#define QSPI0A_DATA2_PTC27 KINETIS_MUX('C',27,7)
#define QSPI0A_DATA3_PTC24 KINETIS_MUX('C',24,7)
#define QSPI0A_SCLK_PTC25 KINETIS_MUX('C',25,7)
#define QSPI0A_SS0_B_PTC29 KINETIS_MUX('C',29,7)
#define QSPI0A_SS1_B_PTC19 KINETIS_MUX('C',19,7)
#define RTC_CLKOUT_PTA22 KINETIS_MUX('A',22,6)
#define SDHC0_CMD_PTA27 KINETIS_MUX('A',27,4)
#define SDHC0_D0_PTA25 KINETIS_MUX('A',25,4)
#define SDHC0_D1_PTA24 KINETIS_MUX('A',24,4)
#define SDHC0_D2_PTA29 KINETIS_MUX('A',29,4)
#define SDHC0_D3_PTA28 KINETIS_MUX('A',28,4)
#define SDHC0_DCLK_PTA26 KINETIS_MUX('A',26,4)
#define SDRAM_CKE_PTB19 KINETIS_MUX('B',19,2)
#define SDRAM_D0_PTC29 KINETIS_MUX('C',29,5)
#define SDRAM_D10_PTA31 KINETIS_MUX('A',31,5)
#define SDRAM_D11_PTA30 KINETIS_MUX('A',30,5)
#define SDRAM_D12_PTA27 KINETIS_MUX('A',27,5)
#define SDRAM_D13_PTA26 KINETIS_MUX('A',26,5)
#define SDRAM_D14_PTA25 KINETIS_MUX('A',25,5)
#define SDRAM_D15_PTA24 KINETIS_MUX('A',24,5)
#define SDRAM_D1_PTC28 KINETIS_MUX('C',28,5)
#define SDRAM_D2_PTC27 KINETIS_MUX('C',27,5)
#define SDRAM_D3_PTC26 KINETIS_MUX('C',26,5)
#define SDRAM_D4_PTC25 KINETIS_MUX('C',25,5)
#define SDRAM_D5_PTC24 KINETIS_MUX('C',24,5)
#define SDRAM_D6_PTB15 KINETIS_MUX('B',15,5)
#define SDRAM_D7_PTB14 KINETIS_MUX('B',14,5)
#define SDRAM_D8_PTB13 KINETIS_MUX('B',13,5)
#define SDRAM_D9_PTB12 KINETIS_MUX('B',12,5)
#define SDRAM_WE_b_PTB2 KINETIS_MUX('B',2,5)
#define SPI3_PCS0_PTE20 KINETIS_MUX('E',20,4)
#define SPI3_SCK_PTE21 KINETIS_MUX('E',21,4)
#define SPI3_SIN_PTE23 KINETIS_MUX('E',23,4)
#define SPI3_SOUT_PTE22 KINETIS_MUX('E',22,4)
#define TPM1_CH0_PTB12 KINETIS_MUX('B',12,6)
#define TPM1_CH1_PTB13 KINETIS_MUX('B',13,6)
#define USB0_CLKIN_PTA22 KINETIS_MUX('A',22,7)
#define USB1_ID_PTA11 KINETIS_MUX('A',11,7)

#endif /* _ZEPHYR_DTS_BINDING_MK28FN2M0VMI15_ */
